app/controllers/disciplines_controller.rb

SELECT "disciplines".* FROM "disciplines"  ORDER BY created_at DESC
---
  def index
    @disciplines = Discipline.all

SELECT  "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @discipline = Discipline.find(params[:id])

INSERT INTO "disciplines" ("name", "average", "workload", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "grafos"], ["average", 1.0], ["workload", 2], ["created_at", "2016-07-15 01:53:34.216982"], ["updated_at", "2016-07-15 01:53:34.216982"]]
---
  def create
    @discipline = Discipline.new(params.require(:discipline).permit(:name, :average, :workload))
    @discipline.save

SELECT  "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = ? LIMIT 1  [["id", 86]]
UPDATE "disciplines" SET "name" = ?, "average" = ?, "workload" = ?, "updated_at" = ? WHERE "disciplines"."id" = ?  [["name", "AlissonPatrick"], ["average", 8.8], ["workload", 30], ["updated_at", "2016-07-20 21:49:57.261669"], ["id", 98]]
---
  def update
    @discipline = Discipline.find(params[:id])
    @discipline.update_attributes(params.require(:discipline).permit(:name, :average, :workload))

SELECT  "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = ? LIMIT 1  [["id", 37]]
DELETE FROM "disciplines" WHERE "disciplines"."id" = ?  [["id", 37]]
---
  def destroy
    discipline = Discipline.find(params[:id])
    discipline.destroy